wty2019wty/esp32c3_sensors-THP-dash/ESP32/sdkconfig.defaults
# 目标芯片：ESP32-C3
CONFIG_IDF_TARGET="esp32c3"

# Flash：4MB Super Mini 常见配置
# NimBLE + Wi-Fi + TLS 后 app 约 1.1MB+，factory 扩到 2MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# BLE 网关（小米温湿度计 pvvx ATC）：开启 NimBLE，关闭 Bluedroid
# Wi-Fi + BLE 共存；仅扫描不连接，连接数压到 1
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_SW_COEXIST_ENABLE=y

# Wi-Fi / 网络：设备只需 STA + HTTPS 上报
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y

# 域名 经 Cloudflare 同时有 A/AAAA。
# 家用路由（尤其移动 CMCC）上 ESP32 的 IPv6 常不可用，lwIP 若优先连 AAAA
# 会表现为 esp-tls「Failed to open new connection in specified timeout」。
# 设备侧关闭 IPv6，只走 IPv4。
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_IPV4=y
CONFIG_LWIP_DNS_MAX_SERVERS=3

# 主任务栈：Wi-Fi + TLS + HTTP 会话较占栈
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 必须 1000：传感器短延时（SHT40 2ms / BMP280 2ms）在 100Hz 下会变成 0 tick
# 功耗已靠 deep sleep 解决，tick 频率对睡眠电流影响可忽略
CONFIG_FREERTOS_HZ=1000

# 动态调频 + 自动 light sleep：空闲段降频休眠；TLS/上报时拉到 max
# （A3 默认 CPU 80；min 10 由 esp_pm_configure 设置）
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# deep sleep 时 Flash 断电，压低睡眠电流（唤醒后恢复）
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y

# NTP：上报前多服务器校时（见 thp_config.h 的 THP_NTP_SERVER_LIST）
CONFIG_LWIP_SNTP_MAX_SERVERS=4
CONFIG_LWIP_DHCP_GET_NTP_SRV=n

# TLS：启用系统证书捆绑包（Cloudflare / 公网 HTTPS）
# 注意：IDF 6.x 中 DEFAULT_BUNDLE / MAX_LEN 为隐藏符号，只开 CERTIFICATE_BUNDLE 即可
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# 部分域名 走 GTS Root R4（交叉签名到 GlobalSign）。IDF6 捆绑包校验
# 对该链可能报 "No matching trusted root"（issue #18674）。开启交叉签名校验
# 并放宽证书数量；同时固件 main/thp_tls_trust.h 内嵌 GTS Root R4 作为 cert_pem。
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_MAX_CERTS=512
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# 日志
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# 连不上时把 esp-tls 细节打出来（连接成功后可改回 INFO 降噪）
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y